12/data/attachments/7f0dd84592a9f40b.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_1b3aca52-9c01-4d4f-87f9-760fb44db61b</nif:username>
            <nif:friendToBeAdded>Randall_win_Actions_79272_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>